# Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# Пример:

# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

# list = ["qwe", "asd", "zxc", "qwe", "ertqwe","qwe"]
# str = input('Введите элемент для поиска: ')
# count = -2
# position = -1
# for i in range(len(list)):
#     if list[i] == str:
#         count += 1
#         if count == 0:
#             position = i
# print(position)

# 2 вариант
# mass = ["123", "234", "123", "567", "123"]
# a = "123"

# try:
#     mass.remove(a)
#     print((mass.index(a))+1)
# except ValueError:
#     print(-1)

# 3 вариант
if mass.count(a) < 2:
    print(-1)
else:
    mass.remove(a)
    print((mass.index(a))+1)